
&НаКлиенте
 Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НазваниеТовара= ВвестиСтроку("", "Введите название товара");
	Если ПроверитьСуществованиеТовара(НазваниеТовара) Тогда
		ТекстСообщения= СтрШаблон("ТОвар %1 найден!", НазваниеТовара);
	Иначе 
		ТекстСообщения= СтрШаблон("ТОвар %1  не найден!", НазваниеТовара);
	конецЕсли;
	Сообщить (ТекстСообщения);
КонецПроцедуры


Функция ПроверитьСуществованиеТовара(НазваниеТовара)
	ТоварСуществует= Справочники.НенужныйХлам.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции